### Terraform Plan Results: `a4b5325bbe84c461affdf2f65529d1c6ba604f6d`\n\n⚠️ Terraform plan proposes changes.\n\n```terraform\n
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_user.user["jane.smith@nesset.com"] will be created
  + resource "azuread_user" "user" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + creation_type                  = (known after apply)
      + department                     = "Marketing"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "Jane Smith"
      + external_user_state            = (known after apply)
      + force_password_change          = false
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + job_title                      = "Designer"
      + mail                           = (known after apply)
      + mail_nickname                  = "janesmith"
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + usage_location                 = "UK"
      + user_principal_name            = "jane.smith@nesset.com"
      + user_type                      = (known after apply)
    }

  # azuread_user.user["john.doe@nesset.com"] will be created
  + resource "azuread_user" "user" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + creation_type                  = (known after apply)
      + department                     = "IT"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "John Doe"
      + external_user_state            = (known after apply)
      + force_password_change          = false
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + job_title                      = "Developer"
      + mail                           = (known after apply)
      + mail_nickname                  = "johndoe"
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + usage_location                 = "US"
      + user_principal_name            = "john.doe@nesset.com"
      + user_type                      = (known after apply)
    }

  # random_password.user_password["jane.smith@nesset.com"] will be created
  + resource "random_password" "user_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!@#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # random_password.user_password["john.doe@nesset.com"] will be created
  + resource "random_password" "user_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!@#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.\n```\n\n<sub>:robot: This comment will be updated with new plans.</sub>
